** Script.py

#+begin_src python :results output
  star_wars = [125, 1977]
  raiders = [115, 1981]
  mean_girls = [97, 2004]

  def distance(movie1, movie2):
      length_difference = (movie1[0] - movie2[0]) ** 2
      year_difference = (movie1[1] - movie2[1]) ** 2
      distance = (length_difference + year_difference) ** 0.5
      return distance

  print(distance(star_wars, raiders))
  print(distance(star_wars, mean_girls))
 #+end_src

#+RESULTS:
: 10.770329614269007
: 38.897300677553446

** Script.py

#+begin_src python :results output
  star_wars = [125, 1977, 11000000]
  raiders = [115, 1981, 18000000]
  mean_girls = [97, 2004, 17000000]

  def distance(movie1, movie2):
    squared_difference = 0
    for i in range(len(movie1)):
      squared_difference += (movie1[i] - movie2[i]) ** 2
      total_distance = squared_difference ** 0.5
    return total_distance

  print(distance(star_wars, raiders))
  print(distance(star_wars, mean_girls))

#+end_src

#+RESULTS:
: 7000000.000008286
: 6000000.000126083

** Script.py

#+begin_src python :results output
  release_dates = [1897, 1998, 2000, 1948, 1962, 1950, 1975, 1960, 2017, 1937, 1968, 1996, 1944, 1891, 1995, 1948, 2011, 1965, 1891, 1978]

  def min_max_normalize(lst):
      minimum = min(lst)
      maximum = max(lst)
      normalized = []
      for value in lst:
          norm = (value - minimum) / (maximum - minimum)
          normalized.append(norm)
      return normalized

  print(min_max_normalize(release_dates))  
#+end_src

#+RESULTS:
: [0.047619047619047616, 0.8492063492063492, 0.8650793650793651, 0.4523809523809524, 0.5634920634920635, 0.46825396825396826, 0.6666666666666666, 0.5476190476190477, 1.0, 0.36507936507936506, 0.6111111111111112, 0.8333333333333334, 0.42063492063492064, 0.0, 0.8253968253968254, 0.4523809523809524, 0.9523809523809523, 0.5873015873015873, 0.0, 0.6904761904761905]

